Configuration.Kanban_for_1C/src/InformationRegisters/канбан_СопоставлениеСтатусов/канбан_СопоставлениеСтатусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>канбан_СопоставлениеСтатусов</name>
  <comment>Для СППР: сопоставление статусов задач и ошибок</comment>
  <attributes>
    <name>СтатусОшибки</name>
    <type>
      <types>DefinedType.канбан_СтатусыОшибок</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтатусЗадачи</name>
    <type>
      <types>DefinedType.канбан_СтатусыЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration.Kanban_for_1C/src/InformationRegisters/канбан_СопоставлениеСтатусов/ManagerModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получает сопоставленный статус
//
// Параметры:
//  СтатусЗадачи - ОпределяемыйТип.канбан_СтатусыЗадач
//  СтатусОшибки - ОпределяемыйТип.канбан_СтатусыОшибок
//
Процедура СопоставленныйСтатус(СтатусЗадачи, СтатусОшибки) Экспорт
	
	Условие = Не ЗначениеЗаполнено(СтатусОшибки);
	Сообщение = НСтр("ru = 'Не заполнен статус задачи или статус ошибки'");
	ОбщегоНазначенияКлиентСервер.Проверить(
		Условие, Сообщение, "РегистрСведений.канбан_СопоставлениеСтатусов.СопоставленныйСтатус");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	канбан_СопоставлениеСтатусов.СтатусОшибки КАК СтатусОшибки
		|ИЗ
		|	РегистрСведений.канбан_СопоставлениеСтатусов КАК канбан_СопоставлениеСтатусов
		|ГДЕ
		|	канбан_СопоставлениеСтатусов.СтатусЗадачи = &СтатусЗадачи";
	
	Запрос.УстановитьПараметр("СтатусЗадачи", СтатусЗадачи);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтатусОшибки = ВыборкаДетальныеЗаписи.СтатусОшибки; // ОпределяемыйТип.канбан_СтатусыОшибок
	КонецЕсли;
	
КонецПроцедуры

// Не используется. Возвращает все записи из регистра сведений "канбан_СопоставлениеСтатусов".
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//    * СтатусЗадачи - ОпределяемыйТип.канбан_СтатусыЗадач
//    * СтатусОшибки - ОпределяемыйТип.канбан_СтатусыОшибок
//
Функция СопоставленныеСтатусы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	канбан_СопоставлениеСтатусов.СтатусЗадачи КАК СтатусЗадачи,
		|	канбан_СопоставлениеСтатусов.СтатусОшибки КАК СтатусОшибки
		|ИЗ
		|	РегистрСведений.канбан_СопоставлениеСтатусов КАК канбан_СопоставлениеСтатусов";
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
